In [1]:
import pandas as pd

In [2]:
pwd

'D:\\Tensorflow basics'

In [11]:
df=pd.read_csv('emp.csv')

In [12]:
df

   EmpCode  EmpName   Location               Email         DOB
0       24  Toshika  gorakhpur    tosh@nagarro.com  1995-02-02
1       34   Puneet      delhi  puneet@nagarro.com  1996-03-02

In [13]:
df.describe()

         EmpCode
count   2.000000
mean   29.000000
std     7.071068
min    24.000000
25%    26.500000
50%    29.000000
75%    31.500000
max    34.000000

In [14]:
df['EmpCode']

0    24
1    34
Name: EmpCode, dtype: int64

In [15]:
df[['EmpCode','EmpName']]

   EmpCode  EmpName
0       24  Toshika
1       34   Puneet

In [16]:
df['EmpCode']>30

0    False
1     True
Name: EmpCode, dtype: bool

In [17]:
my_filter=df['EmpCode']>30

In [18]:
df[my_filter]

   EmpCode EmpName Location               Email         DOB
1       34  Puneet    delhi  puneet@nagarro.com  1996-03-02